#include <iostream>

#include "../../../tensor/function/FHeader.h"

namespace project_NLP
{
	//模型有6个输入，3个输出
	
	int XOROperateMain(int argc, const char ** argv)    //项目主函数入口，传入Main.cpp
	{
		const int dataSize = 64;
		const int testDataSize = 5;


		float trainDataX[dataSize][2] = {{0,0},{0,1},{0,2},{0,3},{0,4},{0,5},{0,6},{0,7},
										 {1,0},{1,1},{1,2},{1,3},{1,4},{1,5},{1,6},{1,7},
										 {2,0},{2,1},{2,2},{2,3},{2,4},{2,5},{2,6},{2,7}, 
										 {3,0},{3,1},{3,2},{3,3},{3,4},{3,5},{3,6},{3,7}, 
										 {4,0},{4,1},{4,2},{4,3},{4,4},{4,5},{4,6},{4,7}, 
										 {5,0},{5,1},{5,2},{5,3},{5,4},{5,5},{5,6},{5,7}, 
										 {6,0},{6,1},{6,2},{6,3},{6,4},{6,5},{6,6},{6,7},
										 {7,0},{7,1},{7,2},{7,3},{7,4},{7,5},{7,6},{7,7}};	//训练集X
										 
		float trainDataY[dataSize] = {0,1,2,3,4,5,6,7,
									  1,0,3,2,5,4,7,6,
									  2,3,0,1,6,7,4,5,
									  3,2,1,0,7,6,5,4,
									  4,5,2,3,0,1,6,7,
									  5,4,3,2,1,0,7,6,
									  6,7,4,5,2,3,0,1,
									  7,6,5,4,3,2,1,0};	//训练集Y

		float trainDataX[testDataSize][2] = { {0,0} ,{1,2} ,{3,5} ,{7,6} ,{7,0} }; //测试集


		//todo 将trainX,trainY转换为6输入的数组



	}


}